package ex02_class;

public class Cat {
	//main을 적지 않음
	/*
	 * 클래스의 구성
	 * 클래스를 구성하는 요소는 필드, 메서드, 생성자 3가지
	 * 
	 * 필드 field - 객체가 가져야할 데이터의 상태를 저장하는 변수
	 * 필드 전역변수 멤버변수라고 부르기도 함
	 * 필드의 값을 초기화 하지 않으면 객체 생성시 자동으로 기본값으로 초기화함
	 * 
	 * 메서드 - 객체의 기능을 담당하는 중괄호 블록
	 * 특정 기능을 수행하는 코드를 따로 중괄호 안에 작성. 1개의 메서드는 1개의 기능
	 * 
	 * 메서드의 선언 method
	 * 반환형 메서드명(파라미터){
	 * 		실행 기능;
	 * 		return 반환값;
	 * }
	 * 상황에 따라서 필요하지 않다면 파라미터와 return 값은 없어도 된다
	 * 
	 * 생성자 constructor
	 * 객체를 생성할때 반드시 호출해야하는 특수한 기능을 가진 메서드
	 * 이 메서드는 객체를 생성하면서 객체변수를 초기화하는 역할
	 * 
	 * 클래스명 변수명 = new 클래스명();
	 * 
	 * 생성자를 한번도 정의한적이 없음에도 불구하고 호출해서 객체를 생성해왔음
	 * 이게 가능한 이유는 직접 선언하지 않아도 기본생성자가 자동으로 생성되기 때문
	 * 
	 * 정적멤버와 static
	 * 클래스 안에서 선언된 필드와 메서드를 멤버라고 부름
	 * 
	 */
}
